Revit 2024 API
DuctSizes Class
 Class RbsDuctSizes being used to store the duct sizes
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class DuctSizes : IEnumerable<MEPSize>,
	IDisposable
Visual Basic
Public Class DuctSizes _
	Implements IEnumerable(Of MEPSize), IDisposable
Visual C++
public ref class DuctSizes : IEnumerable<MEPSize^>,
	IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctSizes
See Also
DuctSizes Members
Autodesk.Revit.DB.Mechanical Namespace